import React from "react";

function About() {
  return (
    <main>
      <section className="justify-start items-center">
        <h1 className="font-manrope text-[3rem]">Немного обо мне</h1>
        <h2 className="font-sans_pro text-center w-[70vmin] text-[2rem]">
          <br />
          Думаю, стоит начать по хронологии жизни. Я родился, вырос, живу в
          Москве. Получилось так, что я учился в 4 разных школах. Совершенно
          разных. От обычной государственной гимназии, заканчивая частной
          Павловской гимназией. Связано это по большей части с переездами. После
          окончания экзаменов, я думал идти либо на физфак, либо на it. Понимая,
          что на физфаке будущего нет, и я, не понимая, что я буду делать, выбор
          мой пал, конечно же, на it. Хотя физику я любить и изучать не
          переставал. Это было одним из самых важных моих выборов.
          <br />
          <br />
          С самого юношества я обожал сидеть над чем-то и кропотливо шаг за
          шагом что-то собирать, реставрировать, улучшать. Каждую мне важную
          вещь я пытаюсь довести до идеала. Я не всегда всё умел, я почти всегда
          ничего не знал о том, что собирался делать, но я всегда учился,
          смотрел, читал о том, как это сделать, пробовал. Это и стало моим
          кредом. Я стал, интересующие меня темы, изучать для самого себя. Так
          было с компьютерами, когда я с 14 лет разбирал, собирал их каждый раз
          улучшая, принося туда что-то новое. Сейчас у меня, конечно, немного
          другие увлечения, чем 7 лет назад. Но даже сейчас, собирая свою
          клавиатуру, я смазываю каждый переключатель вручную, хотя это могут
          сделать за тебя, если продолжать тему ПК и около него, то даже
          банальная установка ОС — это ритуал по поиску лучшей сборки Windows.
          <br />
          <br />
          В университете я понимал, что мне не хватает того, что я хотел делать.
          Поэтому со своими знакомыми и не только мы начали делать веб-сайты для
          разных совершенно людей. По разным причинам так получилось, что нам
          пришлось разойтись. Мне нужно улучшать свои навыки,
          совершенствоваться, поэтому я хочу попасть в БигТех.
          <br />
          <br />
          Говоря про свой опыт работы и достижений, не могу не упомянуть, что я
          был COO в проектно-строительной компании. Объектами были
          железнодорожные станции, МЦК и даже сталинская высотка. Не стану
          перечислять.
          <br />
          <br />
          На данный момент, я хочу решать сложные задачи, улучшать свои навыки,
          потому что знаю, если кто-то это может, и это не огранивает меня
          физиологически, то и я могу. Потому что я знаю, что такое `&quot;`надо`&quot;`, а не
          `&quot;`можно`&quot;`.
        </h2>
      </section>
    </main>
  );
}

export default About;
