import React from "react";

function About() {
  return (
    <main>
      <section className="justify-start items-center">
        <h1 className="font-manrope text-[3rem]">Немного обо мне</h1>
        <h2 className="font-sans_pro text-center w-[70vmin] text-[2rem]">
          <br />
          Давайте начнем с моего детства, когда я родился и вырос в динамичной
          столице России - Москве. Жизнь у меня была насыщенная и интересная,
          потому что я учился в четырех разных школах - от обычной
          государственной гимназии до престижной частной Павловской гимназии.
          Это было вызвано многократными переездами, которые научили меня быстро
          адаптироваться к новым условиям.
          <br />
          <br />
          После окончания школы, я столкнулся с выбором, какую карьеру выбрать:
          физику или IT. Хотя я всегда был увлечен физикой и изучал ее с
          удовольствием, я осознал, что будущее в IT. И это был один из самых
          важных выборов в моей жизни. Я выбрал IT и никогда не пожалел об этом
          решении.
          <br />
          <br />
          С детства у меня была страсть к творчеству и тщательной работе над
          чем-то. Я всегда стремился к совершенству и прилагал все усилия, чтобы
          довести каждую важную вещь до идеала. Даже когда я не знал, как это
          сделать, я учился, изучал тему и пробовал. Это стало моим кредо, и я
          продолжаю исследовать интересующие меня темы. К примеру, в 14 лет я
          начал разбирать и собирать компьютеры, каждый раз принося что-то
          новое. Сегодня я увлекаюсь другими вещами, но все еще тщательно
          работаю над каждым проектом. Например, я только что собрал свою
          клавиатуру, вручную смазывая каждый переключатель. Даже установка
          операционной системы для меня - это ритуал, в ходе которого я ищу
          лучшую сборку Windows.
          <br />
          <br />
          В университете я осознал, что хочу большего в моей карьере и
          профессиональном росте. Я начал работать над созданием веб-сайтов с
          моими знакомыми и не только ими, для разных людей с разными
          потребностями. Я получил огромный опыт в работе в команде и узнал, что
          мне нравится работать в области Frontend разработки. Хотя наш проект
          неожиданно развалился, я улучшил свои навыки и стремился к
          совершенству в своей работе. Сейчас, я очень хочу присоединиться к
          команде БигТех и продолжать развиваться в этом направлении.
          <br />
          <br />
          Говоря про свой опыт работы и достижений, не могу не упомянуть, что я
          был COO в проектно-строительной компании. Объектами были
          железнодорожные станции, МЦК и даже сталинская высотка.
          <br />
          <br />В настоящее время мой главный приоритет - решать сложные задачи
          и развивать свои навыки. Я верю в то, что если кто-то уже справился с
          трудной задачей, то и я смогу. Потому что я знаю, что такое
          &quot;надо&quot;, а не &quot;можно&quot;. Я готов к трудностям и
          исполнению ответственных задач, потому что это помогает мне расти как
          профессионал.
        </h2>
      </section>
    </main>
  );
}

export default About;
