import React from "react";

function About() {
  return (
    <main>
      <section className="justify-start items-center">
        <h1 className="font-manrope text-[3rem]">Немного обо мне</h1>
        <h2 className="font-sans_pro text-center w-[70vmin] text-[2rem]">
          <br />
          Давайте начнем с моего детства. Я родился и вырос в динамичном городе
          России — Москве. Я учился в четырех разных школах: от обычной
          государственной гимназии до престижной частной Павловской гимназии.
          Это было вызвано многократными переездами, которые научили меня быстро
          адаптироваться к новым условиям.
          <br />
          После окончания школы я столкнулся с выбором направления: физика или
          IT. Я всегда был увлечен физикой и изучал ее с удовольствием, но
          осознал, что будущее в IT. Данное решение является одним из самых
          важных выборов в моей жизни. Я выбрал IT направление и не пожалел.
          <br />
          С детства у меня была страсть к творчеству и усердной работе над
          чем-то. Я всегда стремился к совершенству и прилагал все усилия, чтобы
          довести каждую вещь до идеала. Даже когда я не знал, как это сделать,
          я учился, изучал тему и пробовал. Это стало моим кредо, и я продолжаю
          исследовать интересующие меня темы. К примеру, в 14 лет я начал
          разбирать и собирать компьютеры, каждый раз добавляя что-то новое.
          Сейчас у меня много других увлечений и проектов, над которыми я
          работаю не менее тщательно. Например, недавно я собрал свою
          клавиатуру, вручную смазывая каждый переключатель. Даже установка
          операционной системы для меня — это ритуал, в ходе которого я ищу
          лучшую сборку Windows.
          <br />
          В университете я осознал, что хочу больше развиваться в своем
          направлении и идти по карьерной лестнице. Я начал работать над
          созданием веб-сайтов, с моими знакомыми и не только, для разных людей
          с разными потребностями. Я получил огромный опыт в работе в команде и
          узнал, что мне нравится работать в области Frontend разработки. Хоть
          наш проект неожиданно развалился, я улучшил свои навыки и
          усовершенствовался в работе. Сейчас я очень хочу присоединиться к
          команде и продолжать развиваться в этом направлении.
          <br />
          Говоря про свой опыт работы и о достижениях, не могу не упомянуть, что
          я был COO в проектно-строительной компании. Объектами были
          железнодорожные станции, МЦК и даже сталинская высотка.
          <br />В настоящее время мой главный приоритет — решать сложные задачи
          и развивать свои навыки. Я верю в то, что справлюсь с любыми
          заданиями, потому что знаю, что такое «надо». Я готов к трудностям и
          исполнению ответственных задач, потому что это помогает мне расти как
          профессионалу.
        </h2>
      </section>
    </main>
  );
}

export default About;
